# set architecture
synth_ice40
json hardware.json

# read design
read_verilog therm2bin_count.v
read_verilog count_ones.v

select -module therm2bin_pipeline_count

hierarchy -check


# Generate proc netlist
proc; opt;


# Optimizations

fsm; opt; 
memory; opt;

show -prefix select -format pdf
#show -prefix select -format dot -notitle
